Esercizi/PECCIOLI_TDI_Foglio5.org
#+title: Esercizi TDI - Foglio 5
#+date: 24 maggio 2025
#+OPTIONS: toc:nil
#+LATEX_HEADER: \renewcommand{\href}[2]{#2}
#+LATEX_HEADER: \renewcommand{\theenumi}{\alph{enumi}}


* Esercizio 1

Let \(E\) be an equivalence relation on a Polish space \(X\). A set \(A \subseteq X\) is called *\(E\)-invariant* if \(x \in A\) and \(y \mathrel{E} x\) implies \(y \in A\), for all \(x, y \in X\). Suppose that \(E\) is analytic, that is, \(E \in \bm{\Sigma}^1_1(X^2)\). Show that if \(A, B \subseteq X\) are disjoint analytic \(E\)-invariant sets, then there is a Borel \(E\)-invariant set \(C \subseteq X\) separating \(A\) from \(B\), that is, \(A \subseteq C\) and \(C \cap B = \emptyset\).

/Hint/: Recursively define sets \(A_n\), \(C_n \subseteq X\) so that \(A_0 = A\), \(C_n\) is a Borel set separating \(A_n\) from \(B\), and \(A_{n+1} \supseteq C_n\) is \(E\)-invariant, analytic, and disjoint from \(B\).

