Esercizi/PECCIOLI_TDI_Foglio5.tex
\subsection{Soluzione}
\label{sec:org437d64a}

\uline{Claim}: Esistono due famiglie \((A_{n})_{n \in \omega}, (C_{n})_{n \in \omega}\) di sottoinsiemi di \(X\), tali che
\begin{itemize}
\item \(A_{0}=A\);
\item \(\forall\, n \in\omega\): \(A_{n} \subseteq C_{n} \subseteq A_{n+1}\);
\item \(\forall\, n \in\omega\): \(C_{n} \in \bm{{\operatorname{Bor}}}(X)\) e \(C_{n}\cap B = \emptyset\)
\item \(\forall\, n \in \omega\): \(A_{n}\) è \(E\)-invariante, analitico.
\end{itemize}

Se tali famiglie esistono, sia \(C\coloneqq\bigcup_{n \in\omega} C_{n}\).
\begin{itemize}
\item \(C\) è \(E\)-invariante. Infatti, siano \(x,y \in X\), con  \(x\mathrel{E}y\). Se \(x \in C\), allora esiste \(n \in\omega\) tale che \(x \in C_{n} \subseteq A_{n+1}\); poiché \(A_{n+1}\) è \(E\)-invariante, allora \(y \in A_{n+1} \subseteq C_{n+1} \subseteq C\), e pertanto \(y \in C\).
\item \(C \in \bm{{\operatorname{Bor}}}(X)\), poiché unione numerabile di Boreliani.
\item \(A \subseteq C\); infatti \(A = A_{0} \subseteq C_{0} \subseteq C\).
\item \(C\cap B = \emptyset\), poiché ciascun \(C_{n}\) è disgiunto ta \(B\).
\end{itemize}

\uline{Dimostazione del claim}: si procede per induzione.

\begin{enumerate}
\item Sia \(A_{0}\coloneqq A\), \(E\)-invariante e analitico. Allora \(A_{0}, B \subseteq X\) sono due insiemi analitici disgiunti, e pertanto esiste, per il Teorema 3.2.1, un Boreliano \(C_{0} \subseteq X\) tale che
\begin{equation*}
 A_{0} \subseteq C_{0};\quad C_{0}\cap B = \emptyset.
\end{equation*}

\item Per il passo induttivo, si supponga di aver costruito \((A_{i})_{i\le n}\) e \((C_{i})_{i\le n}\). Si costruiscono \(A_{n+1}, C_{n+1}\).

\uline{L'insieme \(A_{n+1}\)} è definito chiudendo \(C_{n}\) rispetto alla relazione di equivalenza \(E\), ovvero
\begin{equation*}
 C_{n} \subseteq A_{n+1} \coloneqq \set{x \in X\mid \exists\,y \in C_{n}\ (x\mathrel{E}y)}.
\end{equation*}
\begin{itemize}
\item Ovviamente \(A_{n} \subseteq C_{n} \subseteq A_{n+1}\), poiché \(E\) è riflessiva.
\item \(A_{n+1}\) è \(E\)-invariante per definizione, poiché \(E\) è transitiva e simmetrica.
\item \(A_{n+1}\) è analitico, poiché \((X\times C_{n})\cap E\) è analitico, e \(A_{n+1}\) è
\begin{equation*}
   \pi_{1}\left((X\times C_{n})\cap E\right)
\end{equation*}
dove \(\pi_{1}:X\times X\to X\) è la proiezione sul primo fattore (per la proposizione 3.1.5).

L'insieme \((X\times C_{n})\cap E\) è analitico
poiché \(\bm{\Sigma}_{1}^{1}\) è chiusa per intersezioni finite e:
\begin{itemize}
\item \(E\) è analitico per ipotesi;
\item \(C_{n}\) è Boreliano per ipotesi, dunque analitico, e, detta \(\pi_{2}: X\times X\to X\) la proiezione sul secondo fattore,
\begin{equation*}
 X\times C_{n}= \pi_{2}^{-1}(C_{n})
\end{equation*}
e siccome \(\bm{\Sigma}_{1}^{1}\) è chiusa per retroimmagini continue, anche \(X\times C_{n}\) è analitico.
\end{itemize}
\item Si nota che \(A_{n+1}\cap B=\emptyset\) poiché, se per assurdo esistesse \(x \in A_{n+1}\cap B\) allora ci sarebbe \(y \in C_{n}\) tale che
\begin{equation*}
   x\mathrel{E}y
\end{equation*}
e siccome \(B\) è \(E\)-invariante, allora \(y \in B\). Dunque \(y \in B\cap C_{n} \neq\emptyset\). Assurdo.
\end{itemize}

Dunque gli insiemi \(A_{n+1}, B \subseteq X\) sono analitici e disgiunti, e pertanto esiste, per il Teorema 3.2.1, un Boreliano \(C_{n+1} \subseteq X\) tale che
\begin{equation*}
 A_{n+1} \subseteq C_{n+1}; \quad C_{n+1}\cap B =\emptyset\qedd
\end{equation*}
\end{enumerate}
\section{Esercizio 2}
\label{sec:org427ea94}

Let \(E\) be an equivalence relation on a Polish space \(X\). A \textbf{partial transversal} for \(E\) is a set \(T \subseteq X\) meeting each \(E\)-equivalence class in at most one point. Show that the following are equivalent:
\begin{enumerate}
\item \(E\) admits an uncountable analytic partial transversal;
\item \(E\) admits an uncountable Borel partial transversal;
\item there is a Borel function \(f: \R \to X\) such that \(f(r_0) \not\mathrel{E} f(r_1)\) for all distinct \(r_0, r_1 \in \R\).
\end{enumerate}
\subsection{Soluzione}
\label{sec:orgf1df743}

\subsubsection{a. implica b.}
\label{sec:org5c34a71}

\uline{Osservazione}: se \(T \subseteq X\) è un insieme trasversale parziale, allora ogni \(T' \subseteq T\) è ancora un insieme trasversale parziale.

Inoltre, \href{../../../../../../org/roam/20250522113216-ogni_insieme_analitico_non_numerabile_ammette_un_sottoinsieme_boreliano_non_numerabile.org}{ogni insieme analitico \(A\) non numerabile ammette un sottoinsieme Boreliano \(B\) non numerabile}, in quanto:
\begin{itemize}
\item siccome \(A\) è analitico, allora \(A\) ha la PSP (per il Teorema 3.4.1);
\item siccome \(A\) è non numerabile, allora esiste
\begin{equation*}
  \iota: 2^{\omega}\to A
\end{equation*}
una immersione topologica, ovvero \(\iota\) continua e iniettiva;
\item pertanto, per il Corollario 3.2.7, \(B\coloneqq\iota(2^{\omega}) \subseteq T\) è Boreliano (poiché \(2^{\omega} \in \bm{{\operatorname{Bor}}}(2^{\omega})\) e \(\iota\) iniettiva) ed è ovviamente non numerabile, poiché ha cardinalità \(2^{\aleph_{0}}>\aleph_{0}\).
\end{itemize}

Pertanto l'insieme analitico trasversale parziale \(T\) ammette un sottoinsieme Boreliano non numerabile \(T' \subseteq T\), e per l'Osservazione iniziale, \(T'\) è un insieme trasversale parziale.
\subsubsection{b. implica a.}
\label{sec:org386d496}

Questo è ovvio, poiché \(\bm{{\operatorname{Bor}}}(X) \subseteq \bm{\Sigma}_{1}^{1}(X)\) per il Corollario 3.1.4.
\subsubsection{b. implica c.}
\label{sec:org650759c}

Sia \(T' \subseteq X\) un insieme Boreliano trasversale parziale. Allora, per il Corollario 3.2.7 esiste un chiuso \(F \subseteq \omega^{\omega}\) e una funzione continua e iniettiva
\begin{equation*}
g: F \subseteq \omega^{\omega}\to X
\end{equation*}
tale che \(g(F)=T'\).

Inoltre, per il Teorema 1.3.17, esiste una biiezione continua
\begin{equation*}
h: F \subseteq \omega^{\omega}\to \R.
\end{equation*}
In particolare, per il Corollario 3.2.6, \(h\) è un Borel-isomorfismo, e pertanto \(h^{-1}: \R\to F\) è una funzione Boreliana.

Si pone quindi \(f\coloneqq g\circ h^{-1}\). Questa è una funzione Boreliana iniettiva (poiché composizione di funzioni iniettive)
\begin{equation*}
f: \R\to X.
\end{equation*}

Siano dunque \(r_{0}\neq r_{1} \in \R\). Allora \(f(r_{0})\neq f(r_{1})\), e \(f(r_{0}), f(r_{1}) \in T'\). Se per assurdo
\begin{equation*}
f(r_{0})\mathrel{E} f(r_{1})
\end{equation*}
si avrebbe che \(T'\) contiene due elementi distinti della stessa classe di \(E\)-equivalenza. Assurdo.

Pertanto, se \(r_{0}\neq r_{1} \in \R\), allora \(f(r_{0})\not\mathrel{E}f(r_{1})\).
\subsubsection{c. implica b.}
\label{sec:orgc543721}

La funzione \(f\) è necessariamente \uline{iniettiva}, poiché se per assurdo esistessero \(r_{0}\neq r_{1} \in \R\) tali che \(f(r_{0})=f(r_{1})\), allora per la \uline{riflessività} di \(E\):
\begin{equation*}
f(r_{0})\mathrel{E}f(r_{1})
\end{equation*}
e questo contraddice l'ipotesi.

Si consideri dunque \(A \subseteq \R\) non numerabile, \(A \in \bm{{\operatorname{Bor}}}(\R)\): allora \(f(A) \subseteq X\) è Boreliano per il Corollario 3.2.7, ed è inoltre un insieme trasversale parziale per \(E\): infatti se per assurdo vi fossero \(x\neq y \in f(A)\) tali che \(x\mathrel{E}y\) allora, siccome \(f\) è iniettiva, esistono \(x_{0}\neq y_{0} \in A\) tali che \(x=f(x_{0})\), \(y=f(y_{0})\), ovvero
\begin{equation*}
f(x_{0})\mathrel{E}f(y_{0}).
\end{equation*}
Questo contraddice l'ipotesi.\qed
\section{Esercizio 3}
\label{sec:org15bc569}

Let \(E\) be an equivalence relation on a Polish space \(X\). A \textbf{transversal} for \(E\) is a set \(T \subseteq X\) meeting every \(E\)-equivalence class in exactly one point. A \textbf{selector} for \(E\) is a map \(s: X \to X\) selecting one element from each \(E\)-equivalence class, that is, \(s(x) \in [x]_E\) and \(s(x) = s(y)\) if \(x \mathrel{E} y\). Show that if \(E\) is analytic, then the following are equivalent:

\begin{enumerate}
\item \(E\) admits an analytic transversal;
\item \(E\) admits a Borel transversal;
\item \(E\) admits a Borel selector.
\end{enumerate}
