Esercizi/PECCIOLI_TDI_Foglio5.org
*** c. implica b.

Sia \(s:X\to X\) un selettore Boreliano per \(E\) e sia \(T\coloneqq s(X)\).

Allora _\(T\) è trasversale_. Infatti incontra ogni classe di \(E\)-equivalenza esattamente una volta.
- _Almeno una volta_: Per ogni \(x \in X\) esiste \(t \in T\) tale che \(x\mathrel{R}t\): \(t=s(x)\).
- _Al più una volta_: Siano \(x\neq y \in T\) e siano \(x_{0},y_{0} \in X\) tali che
  \begin{equation*}
	s(x_{0})=x,\quad s(y_{0})=y.
  \end{equation*}
  Per definizione \(x\mathrel{E}x_{0}\) e \(y\mathrel{E}y_{0}\). Se per assurdo \(x\mathrel{E}y\) allora \(x_{0}\mathrel{E}y_{0}\) per transitività di \(E\). Per definizione, allora
  \begin{equation*}
	s(x_{0}) = s(y_{0})
  \end{equation*}
  ovvero \(x=y\). Assurdo.

Inoltre, sia
\begin{align*}
f: X &\longrightarrow X\times X\\
x &\longmapsto \left(x,s(x)\right)
\end{align*}
Questa è una funzione Boreliana, poiché \(s\) è Boreliana: \(f=\operatorname{Id}_{X}\times s\) e per le proprietà di pag. 54, \(f\) è Boreliana.

Allora, detta \(D \subseteq X\times X\) la diagonale,
\begin{equation*}
D\coloneqq\set{(x,x)\mid x \in X}
\end{equation*}
si ha che \(D\) è chiuso, poiché \(X\) è metrizzabile e quindi Haussdorf. Inoltre \(T=f^{-1}(D)\)
- (\(\subseteq\)): Se \(t \in T\), allora \(s(t)=t\), poiché altrimenti \(s(t) \in T\) sarebbe un elemento distinto da \(t\) della classe \([t]_{E}\). Pertanto \(f(t) = \left(t,s(t)\right) = (t,t) \in D\).
- (\(\supseteq\)): Se \(t \in f^{-1}(D)\) allora \(s(t)=t\) e quindi \(t \in s(X) = T\).

Dunque, siccome \(f\) è Boreliana e \(D\) è chiuso, _\(T\) è un Boreliano_.

*** b. implica a.

Questo è ovvio, poiché \(\bm{{\operatorname{Bor}}}(X) \subseteq \bm{\Sigma}_{1}^{1}(X)\) per il Corollario 3.1.4.

*** a. implica c.

Sia \(T \subseteq X\) un insieme analitico trasversale per \(E\).

Siccome \(T\) è trasversale per \(E\), allora è ben definita la funzione
\begin{align*}
\varphi: X/E &\longrightarrow T\\
[x]_{E} &\longmapsto t \in [x]_{E}.
\end{align*}
poiché per ogni classe di \(E\)-equivalenza esiste un unico elemento \(t \in T\) tale che \(t \in [x]_{E}\).

Si definisce dunque la funzione \(s: X\to T: x\mapsto \varphi\left([x]_{E}\right)\). Questa è un _selettore_, poiché:
- per ogni \(x \in X\): \(s(x) = \varphi\left([x]_{E}\right) = t \in [x]_{E}\);
- se \(x\mathrel{E}y\) allora \([x]_{E}= [y]_{E}\) e pertanto
  \begin{equation*}
	s(x) = \varphi\left([x]_{E}\right) = \varphi\left([y]_{E}\right) = s(y).
  \end{equation*}

Resta da dimostrare che \(s\) sia Boreliana. Sfruttando il Teorema 3.2.4 è sufficiente dimostrare che \(\operatorname{graph}(s) \subseteq X\times X\) sia analitico. Si ha che
\begin{equation*}
\operatorname{graph}(s) = E\cap (X\times T)
\end{equation*}
infatti:
- se \((x,y) \in \operatorname{graph}(s)\) allora \(y=s(x)\), e poiché \(s\) è un selettore: \(x\mathrel{E} s(x)\) e quindi \((x,y) \in E\); inoltre \(x \in X\) e \(y=s(x) \in T\);
- viceversa, se \((x,y) \in E\cap (X\times T)\) allora \(y \in T\) e \(x\mathrel{E} y\); inoltre \(y\) è l'unico elemento di \(T\) tale che \(x\mathrel{E}y\), e pertanto, per definizione \(y=s(x)\).

Sia \(T\) che \(E\) sono analitici per ipotesi. Inoltre \(X\times T = \pi_{2}^{-1}(T)\) è analitico, in quanto retroimmagine continua di un analitico (per la Proposizione 3.1.5), e dunque \(E\cap (X\times T) = \operatorname{graph}(s)\) è analitico.\qed
* Esercizio 4

Prove the following theorem:
#+begin_quote
Let \(X\) be a Polish space. Then every \(A \in \bm{\Pi}^1_1(X)\) can be written as \(A = \bigcup_{\xi < \omega_1} A_\xi\), where \(A_\xi\) is Borel for every \(\xi < \omega_1\).
#+end_quote
by completing the details of the following steps:

a. First prove the theorem for \(X = \mathrm{LO}\) and \(A = \mathrm{WO}\) as follows:
   - Given \(\omega \leq \xi < \omega_1\), let \(\mathrm{WO}_\xi\) be the set of codes for well-orders of \(\omega\) with order type \(\leq \xi\). Show that each \(\mathrm{WO}_\xi\) is analytic.
   - Argue that there is a Borel set \(A_\xi\) such that \(\mathrm{WO}_\xi \subseteq A_\xi \subseteq \mathrm{WO}\).

     /Optional/: Show that \(\mathrm{WO}_\xi\) itself is Borel by showing that its complement is analytic as well.
   - Conclude that \(\mathrm{WO} = \bigcup_{\xi < \omega_1} A_\xi\).

b. Use the fact that \(\mathrm{WO}\) is \(\bm{\Pi}^1_1\)-complete to prove the theorem for \(X = \omega^\omega\) and an arbitrary \(A \in \bm{\Pi}^1_1(\omega^\omega)\).

c. Use the Borel isomorphism theorem for Polish spaces to transfer the result to an arbitrary uncountable Polish space \(X\).

d. What happens if \(X\) is a countable Polish space?

** Soluzione

